CHANGELOG.org
#+title: Change log of selected-window-accent-mode
#+author: James Dyer
#+email: captainflasmr@gmail.com
#+language: en
#+options: ':t toc:nil author:nil email:nil num:nil title:nil
#+startup: showall

This document contains the release notes for each tagged commit on the
project's main git repository: [[https://github.com/captainflasmr/selected-window-accent-mode]].

With a roadmap and issues also supplied

* ISSUES

** TODO Do not apply highlighting when frame only contains 1 window

* ROADMAP

** TODO add darken desaturated and tab highlight examples to README
** TODO define accent color hue adjustment
** TODO define compensating margin
** TODO Incorporate =mode-line-active= and =mode-line-inactive= somehow as this would make more sense especially in the 'default mode.
** TODO header-line not shown on window split - I have a funny feeling this could be very difficult, if not impossible!
** TODO restore modeline height when switching between modes
** TODO adjust the not selected-window margin to avoid little window navigation. disruption, hence translating a fringe pixel width to a number of margin characters, not quite sure how I am going to do this yet.
** TODO excess selected-window disruption in header-line. (not sure I can do much about this)
** TODO define which theme face attribute to use as the main accent color
Currently the default is to use the =highlight= face
** WATCH possible overheads of updating visual elements for each window?
** WATCH careful with removing header-line on all windows, for example magit commit window and probably some others may need to add some logic depending on mode.

* Latest TBD

** DONE define accent color saturation adjustment
CLOSED: [2024-02-08 Thu 12:13]
** DONE define accent color darken adjustment
CLOSED: [2024-02-08 Thu 12:13]
** DONE highlight selected tab with same accent color
CLOSED: [2024-02-08 Thu 11:17]
** DONE add to MELPA
CLOSED: [2024-02-04 Sun 11:17]

* Version 0.5.0 on <2024-01-29 Mon>

** DONE minor change to properly format color-theme-buffer-local
CLOSED: [2024-01-29 Mon 16:46]

* Version 0.4.0 on <2024-01-29>

** DONE pacified package-lint with visual-fill-column 0.0
CLOSED: [2024-01-29 Mon 21:11]
** DONE Added similar package comparisons as suggested
CLOSED: [2024-01-29 Mon 21:11]

* Version 0.3.0 on <2024-01-25>

** DONE rename color-name-to-hex to selected-window-accent--color-name-to-hex
CLOSED: [2024-01-25 Thu 11:38]

* Version 0.2.0 on <2024-01-25>

** DONE Fixing issues to be able to submit to MELPA
CLOSED: [2024-01-25 Fri 10:38]
- byte-compile / flycheck
- checkdoc
- package-lint
- other

** DONE images to img directory and referenced from README
CLOSED: [2024-01-25 Fri 09:05]

* Version 0.1.0 on <2024-01-12>

This is considered beta.

** DONE expand emacs help / documentation
CLOSED: [2024-01-12 Fri 12:49]
** DONE add GNU header
CLOSED: [2024-01-12 Fri 07:46]
** DONE cope better with 0 thickness
CLOSED: [2024-01-12 Fri 07:33]
** DONE Add ChangeLog.
CLOSED: [2024-01-11 Thu 16:16]
** DONE visual-fill-column-mode not working again!
CLOSED: [2024-01-11 Thu 17:17]
** DONE improve modeline contrast between fg and bg
CLOSED: [2024-01-11 Thu 16:19]

* Testing

developing locally using:
#+begin_src elisp
(use-package selected-window-accent-mode
   :load-path "~/repos/selected-window-accent-mode"
#+end_src

commiting to github then removing ~/.config/emacs/elpa/selected-window-accent-mode, changing emacs init to:

#+begin_src elisp
(use-package selected-window-accent-mode
  :vc (:fetcher github :repo "captainflasmr/selected-window-accent-mode")
#+end_src

restart emacs and test
